/* Secondary Zone validation error (>= 2 zones), arg is number of zones */
"%ld secondary zones have no Primary DNS Servers, but at least one Primary DNS Server is required per secondary zone" = "%ld secondary zones have no Primary DNS Servers, but at least one Primary DNS Server is required per secondary zone";

/* validation: '%@' is not a valid IPv4 address. */
"'%@' is not a valid IPv4 address." = "'%@' is not a valid IPv4 address.";

/* validation: A Machine named '%@' already exists. If you would like to enable redundancy for '%@', add another IP Address to it. */
"A Machine named '%@' already exists. If you would like to enable redundancy for '%@', add another IP Address to it." = "A Machine named '%1$@' already exists. If you would like to enable redundancy for '%2$@', add another IP Address to it.";

/* validation: machine must have at least one IP */
"A Machine record requires at least one IP Address." = "A Machine record requires at least one IP Address.";

/* validation: A Nameserver on the zone '%@' has an empty zone or nameserver hostname */
"A Nameserver on the zone '%@' has an empty zone or nameserver hostname" = "A Nameserver on the zone '%@' has an empty zone or nameserver hostname";

/* validation: A Primary Zone named '%@' already exists. */
"A Primary Zone named '%@' already exists." = "A Primary Zone named '%@' already exists.";

/* validation: A Secondary Zone named '%@' already exists. */
"A Secondary Zone named '%@' already exists." = "A Secondary Zone named '%@' already exists.";

/* Zones: type column (Alias) */
"Alias" = "Alias";

/* validation: An IP Address for the machine '%@' is not a valid IPv4 address */
"An IP Address for the machine '%@' is not a valid IPv4 address" = "An IP Address for the machine '%@' is not a valid IPv4 address";

/* No comment provided by engineer. */
"Are you sure you want to abort the save operation now?" = "Are you sure you want to abort the save operation now?";

/* validation: secondary zone must have at least one IP */
"At least one Primary Zone IP Address is required." = "At least one Primary Zone IP Address is required.";

/* validation: Comments cannot contain the \" character. */
"Comments cannot contain the \" character." = "Comments cannot contain the \" character.";

/* Overview: DNS Service is: */
"DNS Service is:" = "DNS Service is:";

/* No comment provided by engineer. */
"Don\\U2019t Upgrade" = "Don’t Upgrade";

/* Each label of the name must consist of only letters, digits, and hyphens. Each label must also be 1 to 63 characters in length, and begin and end with either a letter or a digit. */
"Each label of the name must consist of only letters, digits, and hyphens. Each label must also be 1 to 63 characters in length, and begin and end with either a letter or a digit." = "Each label of the name must consist of only letters, digits, and hyphens. Each label must also be 1 to 63 characters in length, and begin and end with either a letter or a digit.";

/* validation: Hardware Info cannot contain the \" character. */
"Hardware Info cannot contain the \" character." = "Hardware Info cannot contain the \" character.";

/* Zones: type column (Machine) */
"Machine" = "Machine";

/* No comment provided by engineer. */
"Modifying %@ may cause service failures or reachability issues." = "Modifying %@ may cause service failures or reachability issues.";

/* Zones: searchfield (name) */
"Name" = "Name";

/* Alias: default new alias name.  MUST BE ASCII A-Z ONLY, FOLLOWED BY A DOT. */
"newAlias" = "newAlias";

/* Machine: default new machine name.  MUST BE ASCII A-Z ONLY, FOLLOWED BY A DOT. */
"newMachine" = "newMachine";

/* Secondary Zone: default new name.  MUST BE ASCII A-Z ONLY, FOLLOWED BY A DOT. */
"newSecondaryZone." = "newSecondaryZone.";

/* Zones: type column (Primary Zone) */
"Primary Zone" = "Primary Zone";

/* Overview: Primary Zones: */
"Primary Zones:" = "Primary Zones:";

/* Zones: type column (Reverse Mapping) */
"Reverse Mapping" = "Reverse Mapping";

/* Zones: type column (Reverse Zone) */
"Reverse Zone" = "Reverse Zone";

/* overview: service state (running) */
"Running" = "Running";

/* Zones: type column (Secondary Zone) */
"Secondary Zone" = "Secondary Zone";

/* Overview: Secondary Zones: */
"Secondary Zones:" = "Secondary Zones:";

/* Zones: type column (Service) */
"Service" = "Service";

/* validation: Service Name cannot contain an unescaped dot (add a \\ before the dot). */
"Service Name cannot contain an unescaped dot (add a \\ before the dot)." = "Service Name cannot contain an unescaped dot (add a \\ before the dot).";

/* validation: Service Type cannot end with a dot. */
"Service Type cannot end with a dot." = "Service Type cannot end with a dot.";

/* validation: Software Info cannot contain the \" character. */
"Software Info cannot contain the \" character." = "Software Info cannot contain the \" character.";

/* Overview: Start Time: */
"Start Time:" = "Start Time:";

/* overview: service state (stopped) */
"Stopped" = "Stopped";

/* Alias: default new alias value.  MUST BE ASCII A-Z ONLY. */
"target" = "target";

/* Bonjour validation error: domain not fully qualified or @ */
"The automatic client Bonjour browsing domain must either be a fully qualified domain name (it must end with a dot) or be @ (special symbol for the current domain)" = "The automatic client Bonjour browsing domain must either be a fully qualified domain name (it must end with a dot) or be @ (special symbol for the current domain)";

/* The name must be less than 256 characters long (including the dots). */
"The name must be less than 256 characters long (including the dots)." = "The name must be less than 256 characters long (including the dots).";

/* Secondary Zone validation error (just one zone), arg is zone name */
"The secondary zone '%@' requires at least one Primary DNS Server" = "The secondary zone '%@' requires at least one Primary DNS Server";

/* validation: The zone '%@' requires at least one Nameserver */
"The zone '%@' requires at least one Nameserver" = "The zone '%@' requires at least one Nameserver";

/* No comment provided by engineer. */
"This server was configured to provide a self-resolving machine record for '%@'. Modifying that machine record or its zone may cause service failures or make your server unreachable." = "This server was configured to provide a self-resolving machine record for '%@'. Modifying that machine record or its zone may cause service failures or make your server unreachable.";

/* No comment provided by engineer. */
"This server was configured to provide a self-resolving machine record for its own hostname. Stopping the DNS service may cause other service failures or make your server unreachable." = "This server was configured to provide a self-resolving machine record for its own hostname. Stopping the DNS service may cause other service failures or make your server unreachable.";

/* Zones: searchfield (name) */
"Type" = "Type";

/* No comment provided by engineer. */
"Upgrade" = "Upgrade";

/* Zones: searchfield (value) */
"Value" = "Value";

/* No comment provided by engineer. */
"Would you like to upgrade your DNS configuration?" = "Would you like to upgrade your DNS configuration?";

/* Service Record TXT validation error, args are service type and primary zone name */
"You must either set a Service Name on the '%@' Service Record in '%@' or remove its TXT information" = "You must either set a Service Name on the '%1$@' Service Record in '%2$@' or remove its TXT information";

/* Service Record TXT Service Name validation error, args are service type and primary zone name */
"You must either set a Service Name on the '%@' Service Record in '%@'. This value is not optional on Mac OS X Server 10.5" = "You must either set a Service Name on the '%1$@' Service Record in '%2$@'. This value is not optional on Mac OS X Server 10.5";

/* No comment provided by engineer. */
"You must upgrade your DNS configuration to be able to administer DNS with this version of Server Admin." = "You must upgrade your DNS configuration to be able to administer DNS with this version of Server Admin.";

